Examinator/src/Catalogs/ЭлементыПодборкиСУЗ/ЭлементыПодборкиСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭлементыПодборкиСУЗ</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ПодборкиСУЗ</owners>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Класс</name>
    <type>
      <types>CatalogRef.КлассификаторОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаОбъектСУЗ</name>
    <type>
      <types>CatalogRef.ФреймыСУЗ</types>
      <types>CatalogRef.ТерминыСУЗ</types>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
      <types>CatalogRef.ФайлыСУЗ</types>
      <types>CatalogRef.ВопросыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Якорь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВопросов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесВопроса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьРедактироватьНаименование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Catalogs/ЭлементыПодборкиСУЗ/Forms/ФормаЭлемента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	Если ТипЗнч(Объект.СсылкаНаОбъектСУЗ) = Тип("СправочникСсылка.ФайлыСУЗ") Тогда
		Элементы.Якорь.Доступность       = Истина;
	Иначе
		Элементы.Якорь.Доступность       = Ложь;
	КонецЕсли;
	
	Если ТипЗнч(Объект.СсылкаНаОбъектСУЗ) = Тип("СправочникСсылка.ВопросыСУЗ") Тогда
		Элементы.ВесВопроса.Доступность  = Истина;
	Иначе
		Элементы.ВесВопроса.Доступность  = Ложь;
	КонецЕсли;
	
	Элементы.Наименование.ТолькоПросмотр = НЕ Объект.РазрешитьРедактироватьНаименование;
	
	// Определяем тип объекта
	
	ТипОбъекта = ПолучитьТипОбъекта(Объект.СсылкаНаОбъектСУЗ);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТипОбъекта(СсылкаНаОбъектСУЗ)
	Возврат ОбъектыСУЗ.ПолучитьТипОбъектаСУЗ(СсылкаНаОбъектСУЗ);
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьДоступностьЭлементовФормы();

	//////////////////////////////////////////////////////////////////
	РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(Объект);
	РазработкаСУЗ.УстановитьДоступностьДанныхОтПоставщика(ЭтотОбъект);
	//////////////////////////////////////////////////////////////////
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

&НаКлиенте
Процедура УстановитьАвтоНаименование(Команда=Неопределено)
	
	Если ЗначениеЗаполнено(Объект.СсылкаНаОбъектСУЗ) Тогда
		Объект.Наименование = Строка(Объект.СсылкаНаОбъектСУЗ);
	Иначе
		Объект.Наименование = "";
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ОбъектПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда 
		УстановитьАвтоНаименование();
	КонецЕсли;
	
	УстановитьДоступностьЭлементовФормы();

КонецПроцедуры

&НаКлиенте
Процедура РазрешитьРедактироватьНаименованиеПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ <Наименование>
